/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UserProfile {
    pub user_id: ::std::os::raw::c_int,
    pub score: f32,
    pub is_active: bool,
    pub name: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of UserProfile"][::std::mem::size_of::<UserProfile>() - 24usize];
    ["Alignment of UserProfile"][::std::mem::align_of::<UserProfile>() - 8usize];
    ["Offset of field: UserProfile::user_id"]
        [::std::mem::offset_of!(UserProfile, user_id) - 0usize];
    ["Offset of field: UserProfile::score"][::std::mem::offset_of!(UserProfile, score) - 4usize];
    ["Offset of field: UserProfile::is_active"]
        [::std::mem::offset_of!(UserProfile, is_active) - 8usize];
    ["Offset of field: UserProfile::name"][::std::mem::offset_of!(UserProfile, name) - 16usize];
};
